/*
Даны три целых числа: A, B, C. Проверить истинность высказывания: «Хотя бы одно из чисел A, B, C положительное».
*/

import java.util.Scanner;
class Main {
    public static void main(String[] args) {
        System.out.println("Input data:"); Scanner in = new Scanner(System.in);
    
        int A = in.nextInt(); int B = in.nextInt(); int C = in.nextInt();
        
        
    }
}